Ran Plan for project: `project-quick-demo` dir: `Terraform/quick_demo` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_network.default will be created
+ resource "google_compute_network" "default" {
+       auto_create_subnetworks                   = false
+       delete_default_routes_on_create           = false
+       gateway_ipv4                              = (known after apply)
+       id                                        = (known after apply)
+       internal_ipv6_range                       = (known after apply)
+       mtu                                       = (known after apply)
+       name                                      = "wade-test-network"
+       network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
+       project                                   = "adept-presence-396401"
+       routing_mode                              = "GLOBAL"
+       self_link                                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p project-quick-demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://resource.project-44.cn/lock?id=wadexu007%252Flearning_by_doing%252FTerraform%252Fquick_demo%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p project-quick-demo`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
